# ZonesOverlapWarning Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..ZoneFailures..::..ZonesOverlapWarning Property
BuiltInFailures..::..ZoneFailures Class See Also
---
Zone overlap to another zone or another room.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId ZonesOverlapWarning { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property ZonesOverlapWarning As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ ZonesOverlapWarning {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..ZoneFailures Class
Autodesk.Revit.DB Namespace